import React, { useState } from "react";
import { Button, Dialog, DialogTitle, Typography } from "@mui/material";
import { Box } from "@mui/system";

const Policy = () => {
  const [open, setOpen] = useState(false);
  return (
    <div>
      <Button onClick={() => setOpen(true)}>قوانین</Button>
      <Dialog
        open={open}
        onClose={() => setOpen(false)}
        fullWidth
        maxWidth="md"
      >
        <DialogTitle>قوانین و مقررات</DialogTitle>
        <Box padding={2}>
          <Typography
            color="#888"
            lineHeight={2}
            component="span"
            variant="body1"
            display="block"
          >
            دستورالعمل و قوانین استفاده از امکانات آنلاین و آفلاین آموزشگاه
            کنکور هدف :
          </Typography>
          <Typography
            color="#888"
            lineHeight={2}
            component="span"
            variant="body1"
            display="block"
          >
            ۱. هر کاربر یک صفحه مخصوص به خود روی سایت آموزشگاه کنکور هدف دارد که
            تمامی اطلاعات کلاس‌های آنلاین و آفلاین، جزوات، آزمون‌ها و . . . روی
            آن قرار می‌گیرد و یک محیط اَپ بر روی گوشی یا کامپیوتر خود که مخصوص
            ویدیو آفلاین کلاس ها و به اسم خود کاربر می باشد و قابل استفاده در یک
            سیستم .
          </Typography>
          <Typography
            color="#888"
            lineHeight={2}
            component="span"
            variant="body1"
            display="block"
          >
            دستورالعمل و قوانین استفاده از امکانات آنلاین و آفلاین آموزشگاه
            کنکور هدف : ۱. هر کاربر یک صفحه مخصوص به خود روی سایت آموزشگاه کنکور
            هدف دارد که تمامی اطلاعات کلاس‌های آنلاین و آفلاین، جزوات، آزمون‌ها
            و . . . روی آن قرار می‌گیرد و یک محیط اَپ بر روی گوشی یا کامپیوتر
            خود که مخصوص ویدیو آفلاین کلاس ها و به اسم خود کاربر می باشد و قابل
            استفاده در یک سیستم . ۲. برای استفاده از کلاس‌های آنلاین و آفلاین
            آموزشگاه کنکور هدف، ابتدا باید مشخصات خود را به طور دقیق و صحیح در
            پروفایل خود ثبت نمایید . در صورتی که اطلاعات مدرک ارائه شده در زمان
            ثبت نام با اطلاعات وارد شده دستی مغایرت داشته باشد پنل شما بسته
            خواهد شد
          </Typography>
          <Typography
            color="#888"
            lineHeight={2}
            component="span"
            variant="body1"
            display="block"
          >
            ۳. کلاس‌های آنلاین رأس ساعات مشخص شده با استاد مربوطه برگزار
            می‌شوند. حداکثر 48 ساعت پس از پخش آنلاین کلاس، فیلم آن به صورت
            آفلاین به مدت دو هفته از روی پنل اصلی و بعد از آن از روی اپلیکیشن
            های ویندوز/اندروید/آی او اس (ios) کنکور هدف قابل دسترسی خواهد بود
            (یک دسترسی برای هر کاربر مجاز است). بدیهی است که دانش‌آموزانی که بعد
            از دو هفته از شروع کلاس ثبت نام میکنند باید جلسات اول را از طریق اپ
            نگاه کرده و به تبع آن جلسات بعدی . فایل‌ها و جزوات مربوط به هر دوره
            نیز در پروفایل اصلی کاربر روی سایت قرار می‌گیرد. برای کسب اطلاعات در
            مورد اپلیکیشن های پخش فیلم آفلاین دوره ها به قسمت اپلیکیشن ها در
            سایت مراجعه و فیلم آموزشی آن را مشاهده نمایید
          </Typography>
          <Typography
            color="#888"
            lineHeight={2}
            component="span"
            variant="body1"
            display="block"
          >
            ۴. توجه فرمایید کلاس های ثبت نام شده برای دانش‌آموزان پایه (دهم -
            یازدهم )تا یک ماه بعد از پایان هر دوره (آخرین جلسه کلاس آنلاین) و
            برای دانش‌آموزان کنکوری تا روز کنکور سراسری فعال می‌باشند و پس از آن
            دسترسی ها غیر فعال می شود.
          </Typography>
          <Typography
            color="#888"
            lineHeight={2}
            component="span"
            variant="body1"
            display="block"
          >
            ۵. لطفا در خرید خود توجه فرمایید ، امکان لغو و بازگشت هزینه وجود
            ندارد.
          </Typography>
          <Typography
            color="#888"
            lineHeight={2}
            component="span"
            variant="body1"
            display="block"
          >
            ۶. هر کاربر باید جداگانه برای خود حساب کاربری ساخته و دوره های مورد
            نظر خود را خریداری نماید. صاحب قانونی حساب کاربری، دارندۀ شماره تلفن
            همراه ثبت شده برای حساب کاربر است. مسئولیت محرمانه نگه داشتن نام
            کاربری و رمز ورود با خود شماست و در صورتی که متوجه استفاده غیر مجاز
            از نام کاربری، رمز و یا محتوای خریداری شده خود شدید، باید نسبت به
            تغییر رمز عبور خود در اسرع وقت اقدام نمایید
          </Typography>
          <Typography
            color="#888"
            lineHeight={2}
            component="span"
            variant="body1"
            display="block"
          >
            ۷. توزیع مجدد، کپی، تغییر، واگذاری، فروش، و قرض دادن تمام یا بخشی از
            محتوای کلاس‌های آنلاین و آفلاین آموزشگاه کنکور هدف مجاز نیست.
            متخلفین از این قوانین علاوه بر آن که دسترسی‌شان به محتوای کل کلاس‌ها
            قطع خواهد شد، مورد پیگرد قانونی نیز قرار خواهند گرفت.
          </Typography>
        </Box>
      </Dialog>
    </div>
  );
};

export default Policy;
