import { Grid, Typography } from "@mui/material";
import { Container } from "@mui/system";
import React from "react";
import Asked from "../../components/site/FAQ/Asked";

const FAQ = () => {
  return (
    <Container maxWidth="lg">
      <Grid container spacing={3} mt={1}>
        <Grid item xs={12}>
          <Typography
            color="mainText"
            textAlign="center"
            component="h3"
            variant="h6"
            fontWeight={500}
          >
            سوالات پرتکرار
          </Typography>
          <Typography color="#999" textAlign="center" mt={1}>
            در اینجا به چند سوال پرتکرار پاسخ میدهیم
          </Typography>
        </Grid>
        <Grid item xs={12}>
          <Asked
            active="panel1"
            title="نحوه ثبت نام در کلاس‌های آموزشگاه به چه صورت است؟"
            text="از گزینه « ورود / ثبت نام» بالای صفحه اصلی سایت استفاده کنید و پس از احراز هویت، امکان ثبت نام در دوره ها و پکیج‌ها براتان امکان پذیر می باشد"
          />
        </Grid>
        <Grid item xs={12}>
          <Asked
            active="panel2"
            title="مرورگری که برای شرکت در کلاس‌ها توصیه می‌کنید چه مرورگری است؟"
            text="برای استفاده از خدمات مختلف سایت کنکور هدف از مرورگرهای معتبری مانند: chrome , firefox, edge, safari می‌توانید استفاده کنید، کافیست به روزترین نسخه هر یک از این مرورگرها را داشته باشید."
          />
        </Grid>
        <Grid item xs={12}>
          <Asked
            active="panel3"
            title="اپلیکیشن های پلیر هدف را چگونه دانلود کنم؟"
            text="آموزش نصب اپلیکیشن های پلیر هدف به صورت ویدیو در بخش « اپلیکیشن‌ها» در صفحه اول سایت در نظر گرفته شده است."
          />
        </Grid>
        <Grid item xs={12}>
          <Asked
            active="panel4"
            title="در صورت خرید یک دوره یا پکیج تا چه زمانی به ویدیوهای آفلاین آن دوره دسترسی دارم؟"
            text="30 روز پس از برگزاری آخرین جلسه دوره، همه ویدیوها از دسترس خارج می‌شوند، دوره‌های کنکور از این قاعده مستثنی هستند و تا روز کنکور ویدیوها در دسترس می‌باشند."
          />
        </Grid>
        <Grid item xs={12}>
          <Asked
            active="panel5"
            title="برای مشورت در مورد ثبت‌نام با چه شماره‌ای تماس بگیرم؟"
            text="شماره‌های تماس در بخش تماس با ما در پایین صفحه اصلی درنظر گرفته شده است."
          />
        </Grid>
        <Grid item xs={12}>
          <Asked
            active="panel6"
            title="نرم افزار اجازه ورود به من را نمی‎دهد و می‌گوید که با دستگاه دیگری قبلاً وارد شده اید، چطور این مشکل را برطرف کنم؟"
            text="دقت کنید که تنها با یک دستگاه می توانید از امکانات نرم افزار اندروید یا ios استفاده کنید، درصورتی که به هیچ وجه تمایل به استفاده از دستگاه قبلی را ندارید، به پشتیبانی آنلاین پیام دهید تا اجازه ورود با دستگاه جدید را برایتان فراهم کنند و دسترسی دستگاه قبلی هم همزمان قطع خواهد شد."
          />
        </Grid>
        <Grid item xs={12}>
          <Asked
            active="panel7"
            title="در صورت فراموشی رمز عبور چه کاری باید انجام دهم؟"
            text="از گزینه « ورود / ثبت نام» بالای صفحه اصلی سایت استفاده کنید و «رمز عبور خود را فراموش کرده‌ام» را بزنید."
          />
        </Grid>
        <Grid item xs={12}>
          <Asked
            active="panel8"
            title="چه زمانی بعد از برگزاری کلاس به ویدیو و جزوات کلاس دسترسی خواهم داشت؟"
            text="تمام کلاس‌ها 48 ساعت پس از برگزاری در اپلیکیشن های پلیر هدف بارگزاری خواهد شد و به مدت دو هفته پس از بارگزاری دردسترس خواهد بود، دانش‌آموزانی که تمایل به ذخیره ویدیو را دارند بایستی در این بازه ذخیره‌سازی را انجام دهند و پس از دو هفته دیگر امکان ذخیره‌سازی ویدیو وجود ندارد. قابل توجه دانش‌آموزان عزیز، جهت تجربه بهتر و کیفیت مناسب این خدمت، بایستی حتماً یکی از نرم افزارهای اندروید، ویندوز یا ios « اپلیکیشن های پلیر هدف » را داشته باشید."
          />
        </Grid>
        <Grid item xs={12}>
          <Asked
            active="panel9"
            title="این امکان وجود دارد که ویدیو های کلاس را در کامپیوتر شخصی ذخیره کنم؟"
            text="در حال حاضر این امکان در دو نسخه اندروید و ویندوز پلیر هدف در دسترس است. جهت اطلاع کامل امکانات هدف پلیر، ویدیو های بخش« اپلیکیشن‌ها» در صفحه اول سایت را مشاهده کنید."
          />
        </Grid>
        <Grid item xs={12}>
          <Asked
            active="panel10"
            title="چگونه کد تخفیف‌های خرید دوره‌ها را دریافت کنم؟"
            text="جهت اطلاع از تخفیف‌های پیش‌رو و اخبار کنکور هدف اینستاگرام ما را دنبال کنید. همچنین برخی از دوره‌ها، اساتید برای شاگردهای سابقشان درنظر گرفته و توسط ایشان اعلام می‌گردند."
          />
        </Grid>
        <Grid item xs={12}>
          <Asked
            active="panel11"
            title="درصورتی که هنگام برگزاری کلاس با مشکلی با مواجه شدم، از چه طریق می توانم مشکلم را برطرف کنم؟"
            text="پشتیبانی آنلاین سایت در زمان برگزاری کلاس‌ در کوتاه ترین زمان ممکن پیگیر مشکل شما خواهند بود، همچنین شماره تماس‌های پشتیبانی انتهای صفحه اصلی در نظر گرفته شده است."
          />
        </Grid>
      </Grid>
    </Container>
  );
};

export default FAQ;
