export const courseType = [
  "قرائت",
  "تجوید",
  "تلاوت-ترتیل",
  "تلاوت-تحقیق",
  "تلاوت-مجلسی",
  "حفظ-موضوعی",
  "حفظ-ترتیبی",
  "حفظ-فشرده",
  "حفظ-عادی",
  "حفظ-تثبیت(سوره)",
  "حفظ-تثبیت(جزء)",
  "حفظ-تثبیت(کل)",
  "معارف-احکام",
  "معارف-قواید",
  "معارف-نهج‌البلاغه",
  "معارف-صحیفه سجادیه",
  "معارف-سایر ادعیه",
  "معارف-تاریخ",
  "تفسیر-روان",
  "تفسیر-تخصصی",
  "تفسیر-ترتیبی",
  "تفسیر-موضوعی",
  "تفسیر-سوره به سوره",
  "تفسیر-ساختاری",
  "سبک زندگی-تربیت فرزند(کودک)",
  "سبک زندگی-تربیت فرزند(نوجوان)",
  "سبک زندگی-تربیت فرزند(جوان)",
  "سبک زندگی-ازدواج و همسرداری",
  "سبک زندگی-تغذیه و طب اسلامی",
  "سبک زندگی-اخلاق(خانواده)",
  "سبک زندگی-اخلاق(اداری)",
  "سبک زندگی-اخلاق(ورزشی)",
  "سبک زندگی-اخلاق(طنز)",
];
export const Days = [
  "شنبه",
  "یکشنبه",
  "دوشنبه",
  "سه شنبه",
  "چهار شنبه",
  "پنج‌شنبه",
  "جمعه",
];

export const sex = [
  { name: "زن", id: 0 },
  { name: "مرد", id: 1 },
];

export const sex_for_class = [
  { name: "خواهران", id: 0 },
  { name: "برادران", id: 1 },
  { name: "هر دو", id: 2 },
];

export const ages = [
  { name: "نونهالان", id: 0 },
  { name: "نوجوانان", id: 1 },
  { name: "جوانان", id: 2 },
  { name: "بزرگسالان", id: 3 },
];

export const degree = {
  student: [
    [
      { name: "پیش‌دبستانی", id: 0 },
      { name: "دبستان", id: 1 },
      { name: "راهنمایی", id: 2 },
      { name: "متوسطه", id: 3 },
      { name: "دانشگاهی", id: 4 },
      { name: "حوزوی", id: 5 },
    ],
  ],
  teacher: [
    [
      { name: "زیر دیپلم", id: 0 },
      { name: "دیپلم", id: 1 },
      { name: "کارشناسی", id: 2 },
      { name: "کارشناسی‌ارشد", id: 3 },
      { name: "دکتری", id: 4 },
      { name: "حوزوی", id: 5 },
    ],
  ],
};
